smirnovartem8/Milandr/Миландр. Software pack для Keil MDK 5 для МК 1986ВЕ9х,1Т,3Т,4У_v1.5.3/IDE/keil/SVD/MDR1986VE3T.svd
                <register derivedFrom="BUF_FILTER00_MASK">
                    <name>BUF_FILTER16_MASK</name>
                    <addressOffset>0x00000580</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_FILTER">
                    <name>BUF_FILTER16_FILTER</name>
                    <addressOffset>0x00000584</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_MASK">
                    <name>BUF_FILTER17_MASK</name>
                    <addressOffset>0x00000588</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_FILTER">
                    <name>BUF_FILTER17_FILTER</name>
                    <addressOffset>0x0000058C</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_MASK">
                    <name>BUF_FILTER18_MASK</name>
                    <addressOffset>0x00000590</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_FILTER">
                    <name>BUF_FILTER18_FILTER</name>
                    <addressOffset>0x00000594</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_MASK">
                    <name>BUF_FILTER19_MASK</name>
                    <addressOffset>0x00000598</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_FILTER">
                    <name>BUF_FILTER19_FILTER</name>
                    <addressOffset>0x0000059C</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_MASK">
                    <name>BUF_FILTER20_MASK</name>
                    <addressOffset>0x000005A0</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_FILTER">
                    <name>BUF_FILTER20_FILTER</name>
                    <addressOffset>0x000005A4</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_MASK">
                    <name>BUF_FILTER21_MASK</name>
                    <addressOffset>0x000005A8</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_FILTER">
                    <name>BUF_FILTER21_FILTER</name>
                    <addressOffset>0x000005AC</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_MASK">
                    <name>BUF_FILTER22_MASK</name>
                    <addressOffset>0x000005B0</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_FILTER">
                    <name>BUF_FILTER22_FILTER</name>
                    <addressOffset>0x000005B4</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_MASK">
                    <name>BUF_FILTER23_MASK</name>
                    <addressOffset>0x000005B8</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_FILTER">
                    <name>BUF_FILTER23_FILTER</name>
                    <addressOffset>0x000005BC</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_MASK">
                    <name>BUF_FILTER24_MASK</name>
                    <addressOffset>0x000005C0</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_FILTER">
                    <name>BUF_FILTER24_FILTER</name>
                    <addressOffset>0x000005C4</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_MASK">
                    <name>BUF_FILTER25_MASK</name>
                    <addressOffset>0x000005C8</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_FILTER">
                    <name>BUF_FILTER25_FILTER</name>
                    <addressOffset>0x000005CC</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_MASK">
                    <name>BUF_FILTER26_MASK</name>
                    <addressOffset>0x000005D0</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_FILTER">
                    <name>BUF_FILTER26_FILTER</name>
                    <addressOffset>0x000005D4</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_MASK">
                    <name>BUF_FILTER27_MASK</name>
                    <addressOffset>0x000005D8</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_FILTER">
                    <name>BUF_FILTER27_FILTER</name>
                    <addressOffset>0x000005DC</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_MASK">
                    <name>BUF_FILTER28_MASK</name>
                    <addressOffset>0x000005E0</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_FILTER">
                    <name>BUF_FILTER28_FILTER</name>
                    <addressOffset>0x000005E4</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_MASK">
                    <name>BUF_FILTER29_MASK</name>
                    <addressOffset>0x000005E8</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_FILTER">
                    <name>BUF_FILTER29_FILTER</name>
                    <addressOffset>0x000005EC</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_MASK">
                    <name>BUF_FILTER30_MASK</name>
                    <addressOffset>0x000005F0</addressOffset>
                </register>
                <register derivedFrom="BUF_FILTER00_FILTER">
                    <name>BUF_FILTER30_FILTER</name>
                    <addressOffset>0x000005F4</addressOffset>
                </register>
